In [50]:
import pandas as pd

In [51]:
pro = pd.read_csv('교수.csv', index_col='교수번호')
pro2 = pro.copy()
pro2.reset_index(inplace=True)
pro2=pro2[['교수번호', '교수이름', '교수학과']]
pro2

   교수번호 교수이름 교수학과
0   221  이병렬   전산
1   228  이재광   전산
2   311  강승일   전자
3   509  오문환   건축

In [52]:
stu = pd.read_csv('학생.csv', index_col='학생번호')
filt = stu['지도교수'] == 221
stu[filt]

         학생이름 학생학과  학년      생년월일  지도교수
학생번호
92414033  김창덕   전산   4  73/10/26   221
95414058  박혜경   전산   4  76/03/12   221

In [93]:
#학생, 교수 데이터프레임 병합
pro_stu = stu.merge(pro2, how='inner', left_on='지도교수', right_on='교수번호')
pro_stu.drop(columns='교수번호', inplace=True)
pro_stu.sort_values('지도교수')
pro_stu

  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
0  서연우   전산   3  73/10/06   228  이재광   전산
1  김창덕   전산   4  73/10/26   221  이병렬   전산
2  이지행   전자   4  73/11/16   311  강승일   전자
3  김형명   전자   4  73/08/29   311  강승일   전자
4  이원구   건축   3  74/09/30   509  오문환   건축
5  이재영   건축   4  76/02/06   509  오문환   건축
6  박혜경   전산   4  76/03/12   221  이병렬   전산
7  김수정   전산   3  77/12/22   228  이재광   전산

In [ ]:
prostu=pro_stu[['학생번호', '학생이름', '교수이름']]
prostu

In [54]:
for code in pro.index:
    df=pro_stu.groupby('지도교수').get_group(code)
    print(df)

  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
1  김창덕   전산   4  73/10/26   221  이병렬   전산
6  박혜경   전산   4  76/03/12   221  이병렬   전산
  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
0  서연우   전산   3  73/10/06   228  이재광   전산
7  김수정   전산   3  77/12/22   228  이재광   전산
  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
2  이지행   전자   4  73/11/16   311  강승일   전자
3  김형명   전자   4  73/08/29   311  강승일   전자
  학생이름 학생학과  학년      생년월일  지도교수 교수이름 교수학과
4  이원구   건축   3  74/09/30   509  오문환   건축
5  이재영   건축   4  76/02/06   509  오문환   건축

In [55]:
pro.loc[221]

교수이름         이병렬
교수학과          전산
임용일     75/04/03
교수직급         정교수
급여       3000000
Name: 221, dtype: object

In [ ]:
#교수별 지도학생 목록
for idx in pro.index:
    row = pro.loc[idx]
    print('-' * 60)
    print(f'교수번호:{idx} 교수이름:{row["교수이름"]} 교수학과:{row["교수학과"]}')
    filt = stu['지도교수'] == idx
    df = stu[filt]
    for idx in df.index:
        row = df.loc[idx]
        print(f'학생번호:{idx} 학생이름:{row["학생이름"]} 학생학과:{row["학생학과"]}')

------------------------------------------------------------
교수번호:221 교수이름:이병렬 교수학과:전산
학생번호:92414033 학생이름:김창덕 학생학과:전산
학생번호:95414058 학생이름:박혜경 학생학과:전산
------------------------------------------------------------
교수번호:228 교수이름:이재광 교수학과:전산
학생번호:92414029 학생이름:서연우 학생학과:전산
학생번호:96414404 학생이름:김수정 학생학과:전산
------------------------------------------------------------
교수번호:311 교수이름:강승일 교수학과:전자
학생번호:92514009 학생이름:이지행 학생학과:전자
학생번호:92514023 학생이름:김형명 학생학과:전자
------------------------------------------------------------
교수번호:509 교수이름:오문환 교수학과:건축
학생번호:92454018 학생이름:이원구 학생학과:건축
학생번호:95454003 학생이름:이재영 학생학과:건축

In [62]:
cou = pd.read_csv('강좌.csv')
cou

   강좌번호     강좌이름  강의시수  강의실  담당교수  최대인원
0  C301    파일처리론     3  506   221   100
1  C401   데이터베이스     3  414   221    80
2  C421     알고리즘     3  510   228    80
3  C312     자료구조     2  510   228   100
4  E221     논리회로     3  304   311   100
5  A109  한국의건축문화     2  101   509   120

In [65]:
cou_pro = cou.merge(pro2, how='inner', left_on='담당교수', right_on='교수번호')
cou_pro

   강좌번호     강좌이름  강의시수  강의실  담당교수  최대인원  교수번호 교수이름 교수학과
0  C301    파일처리론     3  506   221   100   221  이병렬   전산
1  C401   데이터베이스     3  414   221    80   221  이병렬   전산
2  C421     알고리즘     3  510   228    80   228  이재광   전산
3  C312     자료구조     2  510   228   100   228  이재광   전산
4  E221     논리회로     3  304   311   100   311  강승일   전자
5  A109  한국의건축문화     2  101   509   120   509  오문환   건축

In [70]:
#교수별 담당강좌목록
for idx in pro.index:
    row = pro.loc[idx]
    print('-' * 60)
    print(f'교수번호:{idx} 교수이름:{row["교수이름"]} 교수학과:{row["교수학과"]}')
    filt = cou['담당교수'] == idx
    df = cou[filt]
    for idx in df.index:
        row = cou.loc[idx]
        print(f'강좌명:{row["강좌이름"]}({row["강좌번호"]})')

------------------------------------------------------------
교수번호:221 교수이름:이병렬 교수학과:전산
강좌명:파일처리론(C301)
강좌명:데이터베이스(C401)
------------------------------------------------------------
교수번호:228 교수이름:이재광 교수학과:전산
강좌명:알고리즘(C421)
강좌명:자료구조(C312)
------------------------------------------------------------
교수번호:311 교수이름:강승일 교수학과:전자
강좌명:논리회로(E221)
------------------------------------------------------------
교수번호:509 교수이름:오문환 교수학과:건축
강좌명:한국의건축문화(A109)

In [82]:
enroll = pd.read_csv('수강.csv', index_col=['강좌번호', '학생번호'])
enroll.sort_index()

                    신청일    점수
강좌번호 학생번호
A109 92414029  98/03/03  90.0
     95454003  98/03/05  85.0
C301 92414033  98/03/02  80.0
     92514009  98/03/03  70.0
     92514023  98/03/03  70.0
     95414058  98/03/03  80.0
     95454003  98/03/05  83.0
     96414404  98/03/04  75.0
C312 92414029  98/03/03  70.0
     92454018  98/03/04  90.0
     95414058  98/03/03  80.0
C401 92414029  98/03/03  90.0
     92414033  98/03/02  85.0
     92514023  98/03/03   NaN
     95414058  98/03/03  90.0
     96414404  98/03/04  75.0
C421 92414029  98/03/03   NaN
     92414033  98/03/02   NaN
     96414404  98/03/04  75.0
E221 92414029  98/03/03  75.0
     92454018  98/03/04  90.0
     92514009  98/03/03  85.0
     95454003  98/03/05  75.0

In [85]:
enroll2 = pd.read_csv('수강.csv', index_col=['학생번호', '강좌번호'])
enroll2

                    신청일    점수
학생번호     강좌번호
92414033 C401  98/03/02  85.0
         C301  98/03/02  80.0
         C421  98/03/02   NaN
95414058 C401  98/03/03  90.0
         C301  98/03/03  80.0
         C312  98/03/03  80.0
92514023 C401  98/03/03   NaN
         C301  98/03/03  70.0
92414029 C401  98/03/03  90.0
         C421  98/03/03   NaN
         C312  98/03/03  70.0
         E221  98/03/03  75.0
         A109  98/03/03  90.0
92514009 C301  98/03/03  70.0
         E221  98/03/03  85.0
96414404 C301  98/03/04  75.0
         C401  98/03/04  75.0
         C421  98/03/04  75.0
92454018 C312  98/03/04  90.0
         E221  98/03/04  90.0
95454003 A109  98/03/05  85.0
         C301  98/03/05  83.0
         E221  98/03/05  75.0

In [104]:
#학생별 학생이름, 평균 점수
enroll3 = pd.read_csv('수강.csv')
group=enroll3.groupby('학생번호')['점수'].mean().to_frame('평균')

stu = pd.read_csv('학생.csv', index_col='학생번호')
join = stu.join(group)
join

         학생이름 학생학과  학년      생년월일  지도교수         평균
학생번호
92414029  서연우   전산   3  73/10/06   228  81.250000
92414033  김창덕   전산   4  73/10/26   221  82.500000
92514009  이지행   전자   4  73/11/16   311  77.500000
92514023  김형명   전자   4  73/08/29   311  70.000000
92454018  이원구   건축   3  74/09/30   509  90.000000
95454003  이재영   건축   4  76/02/06   509  81.000000
95414058  박혜경   전산   4  76/03/12   221  83.333333
96414404  김수정   전산   3  77/12/22   228  75.000000

In [ ]:
#강좌별 강좌정보, 담당교수이름, 평균점수
group = enroll3.groupby('강좌번호')['점수'].mean().to_frame('평균')

cou = pd.read_csv('강좌.csv', index_col='강좌번호')
join = cou.join(group)
join

         강좌이름  강의시수  강의실  담당교수  최대인원         평균
강좌번호
C301    파일처리론     3  506   221   100  76.333333
C401   데이터베이스     3  414   221    80  85.000000
C421     알고리즘     3  510   228    80  75.000000
C312     자료구조     2  510   228   100  80.000000
E221     논리회로     3  304   311   100  81.250000
A109  한국의건축문화     2  101   509   120  87.500000